akbar-q/Matlab-Simulink/ESP32Arm6DOF_ert_rtw/ESP32Arm6DOF.c
/*
 * File: ESP32Arm6DOF.c
 *
 * Code generated for Simulink model 'ESP32Arm6DOF'.
 *
 * Model version                  : 1.43
 * Simulink Coder version         : 24.1 (R2024a) 19-Nov-2023
 * C/C++ source code generated on : Wed Apr 30 11:27:39 2025
 *
 * Target selection: ert.tlc
 * Embedded hardware selection: ARM Compatible->ARM Cortex
 * Code generation objectives: Unspecified
 * Validation result: Not run
 */

#include "ESP32Arm6DOF.h"
#include "ESP32Arm6DOF_private.h"
#include "rt_nonfinite.h"
#include "rtwtypes.h"
#include "zero_crossing_types.h"
#include <math.h>

/* Block signals (default storage) */
B_ESP32Arm6DOF_T ESP32Arm6DOF_B;

/* Continuous states */
X_ESP32Arm6DOF_T ESP32Arm6DOF_X;

/* Disabled State Vector */
XDis_ESP32Arm6DOF_T ESP32Arm6DOF_XDis;

/* Block states (default storage) */
DW_ESP32Arm6DOF_T ESP32Arm6DOF_DW;

/* Previous zero-crossings (trigger) states */
PrevZCX_ESP32Arm6DOF_T ESP32Arm6DOF_PrevZCX;

/* External outputs (root outports fed by signals with default storage) */
ExtY_ESP32Arm6DOF_T ESP32Arm6DOF_Y;

/* Real-time model */
static RT_MODEL_ESP32Arm6DOF_T ESP32Arm6DOF_M_;
RT_MODEL_ESP32Arm6DOF_T *const ESP32Arm6DOF_M = &ESP32Arm6DOF_M_;

/*
 * This function updates continuous states using the ODE3 fixed-step
 * solver algorithm
 */
static void rt_ertODEUpdateContinuousStates(RTWSolverInfo *si )
{
  /* Solver Matrices */
  static const real_T rt_ODE3_A[3] = {
    1.0/2.0, 3.0/4.0, 1.0
  };

  static const real_T rt_ODE3_B[3][3] = {
    { 1.0/2.0, 0.0, 0.0 },

    { 0.0, 3.0/4.0, 0.0 },

    { 2.0/9.0, 1.0/3.0, 4.0/9.0 }
  };

  time_T t = rtsiGetT(si);
  time_T tnew = rtsiGetSolverStopTime(si);
  time_T h = rtsiGetStepSize(si);
  real_T *x = rtsiGetContStates(si);
  ODE3_IntgData *id = (ODE3_IntgData *)rtsiGetSolverData(si);
  real_T *y = id->y;
  real_T *f0 = id->f[0];
  real_T *f1 = id->f[1];
  real_T *f2 = id->f[2];
  real_T hB[3];
  int_T i;
  int_T nXc = 2;
  rtsiSetSimTimeStep(si,MINOR_TIME_STEP);

  /* Save the state values at time t in y, we'll use x as ynew. */
  (void) memcpy(y, x,
                (uint_T)nXc*sizeof(real_T));

  /* Assumes that rtsiSetT and ModelOutputs are up-to-date */
  /* f0 = f(t,y) */
  rtsiSetdX(si, f0);
  ESP32Arm6DOF_derivatives();

  /* f(:,2) = feval(odefile, t + hA(1), y + f*hB(:,1), args(:)(*)); */
  hB[0] = h * rt_ODE3_B[0][0];
  for (i = 0; i < nXc; i++) {
    x[i] = y[i] + (f0[i]*hB[0]);
  }

  rtsiSetT(si, t + h*rt_ODE3_A[0]);
  rtsiSetdX(si, f1);
  ESP32Arm6DOF_step();
  ESP32Arm6DOF_derivatives();

  /* f(:,3) = feval(odefile, t + hA(2), y + f*hB(:,2), args(:)(*)); */
  for (i = 0; i <= 1; i++) {
    hB[i] = h * rt_ODE3_B[1][i];
  }

  for (i = 0; i < nXc; i++) {
    x[i] = y[i] + (f0[i]*hB[0] + f1[i]*hB[1]);
  }

  rtsiSetT(si, t + h*rt_ODE3_A[1]);
  rtsiSetdX(si, f2);
  ESP32Arm6DOF_step();
  ESP32Arm6DOF_derivatives();

  /* tnew = t + hA(3);
     ynew = y + f*hB(:,3); */
  for (i = 0; i <= 2; i++) {
    hB[i] = h * rt_ODE3_B[2][i];
  }

  for (i = 0; i < nXc; i++) {
    x[i] = y[i] + (f0[i]*hB[0] + f1[i]*hB[1] + f2[i]*hB[2]);
  }

  rtsiSetT(si, tnew);
  rtsiSetSimTimeStep(si,MAJOR_TIME_STEP);
}

real_T rt_roundd_snf(real_T u)
{
  real_T y;
  if (fabs(u) < 4.503599627370496E+15) {
    if (u >= 0.5) {
      y = floor(u + 0.5);
    } else if (u > -0.5) {
      y = u * 0.0;
    } else {
      y = ceil(u - 0.5);
    }
  } else {
    y = u;
  }

  return y;
}

/* Model step function */
void ESP32Arm6DOF_step(void)
{
  /* local block i/o variables */
  boolean_T rtb_LogicalOperator;
  boolean_T rtb_LogicalOperator_h;
  boolean_T rtb_LogicalOperator_g;
  boolean_T rtb_LogicalOperator_k;
  boolean_T rtb_LogicalOperator_gb;
  boolean_T rtb_LogicalOperator_e;
  real_T K;
  real_T rtb_Integrator_d;
  uint16_T y;
  uint8_T tmp;
  if (rtmIsMajorTimeStep(ESP32Arm6DOF_M)) {
    /* set solver stop time */
    rtsiSetSolverStopTime(&ESP32Arm6DOF_M->solverInfo,
                          ((ESP32Arm6DOF_M->Timing.clockTick0+1)*
      ESP32Arm6DOF_M->Timing.stepSize0));
  }                                    /* end MajorTimeStep */

  /* Update absolute time of base rate at minor time step */
  if (rtmIsMinorTimeStep(ESP32Arm6DOF_M)) {
    ESP32Arm6DOF_M->Timing.t[0] = rtsiGetT(&ESP32Arm6DOF_M->solverInfo);
  }

  if (rtmIsMajorTimeStep(ESP32Arm6DOF_M)) {
    /* Logic: '<S40>/Logical Operator' incorporates:
     *  Constant: '<S40>/Constant'
     *  Constant: '<S40>/Time constant'
     *  Constant: '<S43>/Constant'
     *  Constant: '<S44>/Constant'
     *  RelationalOperator: '<S43>/Compare'
     *  RelationalOperator: '<S44>/Compare'
     *  Sum: '<S40>/Sum1'
     */
    rtb_LogicalOperator = ((ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_g -
      ESP32Arm6DOF_B.Probe_fr[0] <= ESP32Arm6DOF_P.Constant_Value_c) &&
      (ESP32Arm6DOF_P.LowPassFilterDiscreteorConti_dy <
       ESP32Arm6DOF_P.CompareToConstant_const));

    /* Outputs for Enabled SubSystem: '<Root>/Enabled Subsystem' incorporates:
     *  EnablePort: '<S2>/Enable'
     */
    if (rtsiIsModeUpdateTimeStep(&ESP32Arm6DOF_M->solverInfo)) {
      /* Constant: '<Root>/Constant' */
      ESP32Arm6DOF_DW.EnabledSubsystem_MODE = (ESP32Arm6DOF_P.Constant_Value_f >
        0.0);
    }

    /* End of Outputs for SubSystem: '<Root>/Enabled Subsystem' */
  }

  /* Outputs for Enabled SubSystem: '<Root>/Enabled Subsystem' incorporates:
   *  EnablePort: '<S2>/Enable'
   */
  if (ESP32Arm6DOF_DW.EnabledSubsystem_MODE) {
    /* FromWorkspace: '<S13>/fromWS_Signal 1' */
    {
      real_T t = ESP32Arm6DOF_M->Timing.t[0];
      real_T *pTimeValues = (real_T *)
        ESP32Arm6DOF_DW.fromWS_Signal1_PWORK.TimePtr;
      real_T *pDataValues = (real_T *)
        ESP32Arm6DOF_DW.fromWS_Signal1_PWORK.DataPtr;
      if (t < pTimeValues[0]) {
        ESP32Arm6DOF_B.BaseSig = 0.0;
      } else if (t == pTimeValues[12]) {
        ESP32Arm6DOF_B.BaseSig = pDataValues[12];
      } else if (t > pTimeValues[12]) {
        ESP32Arm6DOF_B.BaseSig = 0.0;
      } else {
        int_T currTimeIndex = ESP32Arm6DOF_DW.fromWS_Signal1_IWORK.PrevIndex;
        if (t < pTimeValues[currTimeIndex]) {
          while (t < pTimeValues[currTimeIndex]) {
            currTimeIndex--;
          }
        } else {
          while (t >= pTimeValues[currTimeIndex + 1]) {
            currTimeIndex++;
          }
        }

        ESP32Arm6DOF_B.BaseSig = pDataValues[currTimeIndex];
        ESP32Arm6DOF_DW.fromWS_Signal1_IWORK.PrevIndex = currTimeIndex;
      }
    }

