akbar-q/Matlab-Simulink/ESP32Arm6DOF_ert_rtw/ESP32Arm6DOF.c
    /* FromWorkspace: '<S15>/fromWS_Signal 1' */
    {
      real_T t = ESP32Arm6DOF_M->Timing.t[0];
      real_T *pTimeValues = (real_T *)
        ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_p.TimePtr;
      real_T *pDataValues = (real_T *)
        ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_p.DataPtr;
      if (t < pTimeValues[0]) {
        ESP32Arm6DOF_B.LowerSignal = 0.0;
      } else if (t == pTimeValues[12]) {
        ESP32Arm6DOF_B.LowerSignal = pDataValues[12];
      } else if (t > pTimeValues[12]) {
        ESP32Arm6DOF_B.LowerSignal = 0.0;
      } else {
        int_T currTimeIndex = ESP32Arm6DOF_DW.fromWS_Signal1_IWORK_k.PrevIndex;
        if (t < pTimeValues[currTimeIndex]) {
          while (t < pTimeValues[currTimeIndex]) {
            currTimeIndex--;
          }
        } else {
          while (t >= pTimeValues[currTimeIndex + 1]) {
            currTimeIndex++;
          }
        }

        ESP32Arm6DOF_B.LowerSignal = pDataValues[currTimeIndex];
        ESP32Arm6DOF_DW.fromWS_Signal1_IWORK_k.PrevIndex = currTimeIndex;
      }
    }

    /* FromWorkspace: '<S16>/fromWS_Signal 1' */
    {
      real_T t = ESP32Arm6DOF_M->Timing.t[0];
      real_T *pTimeValues = (real_T *)
        ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_n.TimePtr;
      real_T *pDataValues = (real_T *)
        ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_n.DataPtr;
      if (t < pTimeValues[0]) {
        ESP32Arm6DOF_B.MidSignal = 0.0;
      } else if (t == pTimeValues[12]) {
        ESP32Arm6DOF_B.MidSignal = pDataValues[12];
      } else if (t > pTimeValues[12]) {
        ESP32Arm6DOF_B.MidSignal = 0.0;
      } else {
        int_T currTimeIndex = ESP32Arm6DOF_DW.fromWS_Signal1_IWORK_i.PrevIndex;
        if (t < pTimeValues[currTimeIndex]) {
          while (t < pTimeValues[currTimeIndex]) {
            currTimeIndex--;
          }
        } else {
          while (t >= pTimeValues[currTimeIndex + 1]) {
            currTimeIndex++;
          }
        }

        ESP32Arm6DOF_B.MidSignal = pDataValues[currTimeIndex];
        ESP32Arm6DOF_DW.fromWS_Signal1_IWORK_i.PrevIndex = currTimeIndex;
      }
    }

    /* FromWorkspace: '<S18>/fromWS_Signal 1' */
    {
      real_T t = ESP32Arm6DOF_M->Timing.t[0];
      real_T *pTimeValues = (real_T *)
        ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_d.TimePtr;
      real_T *pDataValues = (real_T *)
        ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_d.DataPtr;
      if (t < pTimeValues[0]) {
        ESP32Arm6DOF_B.UpperSignal = 0.0;
      } else if (t == pTimeValues[12]) {
        ESP32Arm6DOF_B.UpperSignal = pDataValues[12];
      } else if (t > pTimeValues[12]) {
        ESP32Arm6DOF_B.UpperSignal = 0.0;
      } else {
        int_T currTimeIndex = ESP32Arm6DOF_DW.fromWS_Signal1_IWORK_l.PrevIndex;
        if (t < pTimeValues[currTimeIndex]) {
          while (t < pTimeValues[currTimeIndex]) {
            currTimeIndex--;
          }
        } else {
          while (t >= pTimeValues[currTimeIndex + 1]) {
            currTimeIndex++;
          }
        }

        ESP32Arm6DOF_B.UpperSignal = pDataValues[currTimeIndex];
        ESP32Arm6DOF_DW.fromWS_Signal1_IWORK_l.PrevIndex = currTimeIndex;
      }
    }

    /* FromWorkspace: '<S17>/fromWS_Signal 1' */
    {
      real_T t = ESP32Arm6DOF_M->Timing.t[0];
      real_T *pTimeValues = (real_T *)
        ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_f.TimePtr;
      real_T *pDataValues = (real_T *)
        ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_f.DataPtr;
      if (t < pTimeValues[0]) {
        ESP32Arm6DOF_B.RotationSignal = 0.0;
      } else if (t == pTimeValues[12]) {
        ESP32Arm6DOF_B.RotationSignal = pDataValues[12];
      } else if (t > pTimeValues[12]) {
        ESP32Arm6DOF_B.RotationSignal = 0.0;
      } else {
        int_T currTimeIndex = ESP32Arm6DOF_DW.fromWS_Signal1_IWORK_ko.PrevIndex;
        if (t < pTimeValues[currTimeIndex]) {
          while (t < pTimeValues[currTimeIndex]) {
            currTimeIndex--;
          }
        } else {
          while (t >= pTimeValues[currTimeIndex + 1]) {
            currTimeIndex++;
          }
        }

        ESP32Arm6DOF_B.RotationSignal = pDataValues[currTimeIndex];
        ESP32Arm6DOF_DW.fromWS_Signal1_IWORK_ko.PrevIndex = currTimeIndex;
      }
    }

    /* FromWorkspace: '<S14>/fromWS_Signal 1' */
    {
      real_T t = ESP32Arm6DOF_M->Timing.t[0];
      real_T *pTimeValues = (real_T *)
        ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_nz.TimePtr;
      real_T *pDataValues = (real_T *)
        ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_nz.DataPtr;
      if (t < pTimeValues[0]) {
        ESP32Arm6DOF_B.ClawSignal = 0.0;
      } else if (t == pTimeValues[12]) {
        ESP32Arm6DOF_B.ClawSignal = pDataValues[12];
      } else if (t > pTimeValues[12]) {
        ESP32Arm6DOF_B.ClawSignal = 0.0;
      } else {
        int_T currTimeIndex = ESP32Arm6DOF_DW.fromWS_Signal1_IWORK_a.PrevIndex;
        if (t < pTimeValues[currTimeIndex]) {
          while (t < pTimeValues[currTimeIndex]) {
            currTimeIndex--;
          }
        } else {
          while (t >= pTimeValues[currTimeIndex + 1]) {
            currTimeIndex++;
          }
        }

        ESP32Arm6DOF_B.ClawSignal = pDataValues[currTimeIndex];
        ESP32Arm6DOF_DW.fromWS_Signal1_IWORK_a.PrevIndex = currTimeIndex;
      }
    }
  }

  /* End of Outputs for SubSystem: '<Root>/Enabled Subsystem' */

  /* Gain: '<S7>/K' */
  K = ESP32Arm6DOF_P.LowPassFilterDiscreteorContinuo *
    ESP32Arm6DOF_B.UpperSignal;
  if (rtmIsMajorTimeStep(ESP32Arm6DOF_M)) {
    /* DiscreteIntegrator: '<S46>/Integrator' */
    if (ESP32Arm6DOF_DW.Integrator_IC_LOADING != 0) {
      ESP32Arm6DOF_DW.Integrator_DSTATE = K;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE > ESP32Arm6DOF_P.Integrator_UpperSat)
      {
        ESP32Arm6DOF_DW.Integrator_DSTATE = ESP32Arm6DOF_P.Integrator_UpperSat;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE <
                 ESP32Arm6DOF_P.Integrator_LowerSat) {
        ESP32Arm6DOF_DW.Integrator_DSTATE = ESP32Arm6DOF_P.Integrator_LowerSat;
      }
    }

