akbar-q/Matlab-Simulink/ESP32Arm6DOF_ert_rtw/ESP32Arm6DOF.c
    if (rtb_LogicalOperator || (ESP32Arm6DOF_DW.Integrator_PrevResetState != 0))
    {
      ESP32Arm6DOF_DW.Integrator_DSTATE = K;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE > ESP32Arm6DOF_P.Integrator_UpperSat)
      {
        ESP32Arm6DOF_DW.Integrator_DSTATE = ESP32Arm6DOF_P.Integrator_UpperSat;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE <
                 ESP32Arm6DOF_P.Integrator_LowerSat) {
        ESP32Arm6DOF_DW.Integrator_DSTATE = ESP32Arm6DOF_P.Integrator_LowerSat;
      }
    }

    /* Saturate: '<S46>/Saturation' incorporates:
     *  DiscreteIntegrator: '<S46>/Integrator'
     */
    if (ESP32Arm6DOF_DW.Integrator_DSTATE > ESP32Arm6DOF_P.Saturation_UpperSat)
    {
      /* Saturate: '<S46>/Saturation' */
      ESP32Arm6DOF_B.Saturation = ESP32Arm6DOF_P.Saturation_UpperSat;
    } else if (ESP32Arm6DOF_DW.Integrator_DSTATE <
               ESP32Arm6DOF_P.Saturation_LowerSat) {
      /* Saturate: '<S46>/Saturation' */
      ESP32Arm6DOF_B.Saturation = ESP32Arm6DOF_P.Saturation_LowerSat;
    } else {
      /* Saturate: '<S46>/Saturation' */
      ESP32Arm6DOF_B.Saturation = ESP32Arm6DOF_DW.Integrator_DSTATE;
    }

    /* End of Saturate: '<S46>/Saturation' */

    /* MATLABSystem: '<Root>/Upper Servo' */
    if (ESP32Arm6DOF_B.Saturation < 0.0) {
      tmp = 0U;
    } else if (ESP32Arm6DOF_B.Saturation > 180.0) {
      tmp = 180U;
    } else {
      rtb_Integrator_d = rt_roundd_snf(ESP32Arm6DOF_B.Saturation);
      if (rtb_Integrator_d < 256.0) {
        tmp = (uint8_T)rtb_Integrator_d;
      } else {
        tmp = MAX_uint8_T;
      }
    }

    MW_servoWrite(6, tmp);

    /* End of MATLABSystem: '<Root>/Upper Servo' */

    /* MinMax: '<S40>/Max' incorporates:
     *  Constant: '<S40>/Time constant'
     */
    if ((ESP32Arm6DOF_B.Probe_fr[0] >=
         ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_g) || rtIsNaN
        (ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_g)) {
      rtb_Integrator_d = ESP32Arm6DOF_B.Probe_fr[0];
    } else {
      rtb_Integrator_d = ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_g;
    }

    /* End of MinMax: '<S40>/Max' */

    /* Fcn: '<S40>/Avoid Divide by Zero' */
    ESP32Arm6DOF_B.AvoidDividebyZero = (real_T)(rtb_Integrator_d == 0.0) *
      2.2204460492503131e-16 + rtb_Integrator_d;
  }

  /* Product: '<S7>/1//T' incorporates:
   *  Sum: '<S7>/Sum1'
   */
  ESP32Arm6DOF_B.uT = 1.0 / ESP32Arm6DOF_B.AvoidDividebyZero * (K -
    ESP32Arm6DOF_B.Saturation);

  /* Gain: '<S4>/K' */
  K = ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_p * ESP32Arm6DOF_B.BaseSig;
  if (rtmIsMajorTimeStep(ESP32Arm6DOF_M)) {
    /* Logic: '<S19>/Logical Operator' incorporates:
     *  Constant: '<S19>/Constant'
     *  Constant: '<S19>/Time constant'
     *  Constant: '<S22>/Constant'
     *  Constant: '<S23>/Constant'
     *  RelationalOperator: '<S22>/Compare'
     *  RelationalOperator: '<S23>/Compare'
     *  Sum: '<S19>/Sum1'
     */
    rtb_LogicalOperator_h = ((ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_o -
      ESP32Arm6DOF_B.Probe[0] <= ESP32Arm6DOF_P.Constant_Value) &&
      (ESP32Arm6DOF_P.LowPassFilterDiscreteorConti_ly <
       ESP32Arm6DOF_P.CompareToConstant_const_h));

    /* DiscreteIntegrator: '<S25>/Integrator' */
    if (ESP32Arm6DOF_DW.Integrator_IC_LOADING_l != 0) {
      ESP32Arm6DOF_DW.Integrator_DSTATE_k = K;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE_k >
          ESP32Arm6DOF_P.Integrator_UpperSat_f) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_k =
          ESP32Arm6DOF_P.Integrator_UpperSat_f;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_k <
                 ESP32Arm6DOF_P.Integrator_LowerSat_f) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_k =
          ESP32Arm6DOF_P.Integrator_LowerSat_f;
      }
    }

    if (rtb_LogicalOperator_h || (ESP32Arm6DOF_DW.Integrator_PrevResetState_a !=
         0)) {
      ESP32Arm6DOF_DW.Integrator_DSTATE_k = K;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE_k >
          ESP32Arm6DOF_P.Integrator_UpperSat_f) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_k =
          ESP32Arm6DOF_P.Integrator_UpperSat_f;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_k <
                 ESP32Arm6DOF_P.Integrator_LowerSat_f) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_k =
          ESP32Arm6DOF_P.Integrator_LowerSat_f;
      }
    }

    /* Saturate: '<S25>/Saturation' incorporates:
     *  DiscreteIntegrator: '<S25>/Integrator'
     */
    if (ESP32Arm6DOF_DW.Integrator_DSTATE_k >
        ESP32Arm6DOF_P.Saturation_UpperSat_b) {
      /* Saturate: '<S25>/Saturation' */
      ESP32Arm6DOF_B.Saturation_d = ESP32Arm6DOF_P.Saturation_UpperSat_b;
    } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_k <
               ESP32Arm6DOF_P.Saturation_LowerSat_d) {
      /* Saturate: '<S25>/Saturation' */
      ESP32Arm6DOF_B.Saturation_d = ESP32Arm6DOF_P.Saturation_LowerSat_d;
    } else {
      /* Saturate: '<S25>/Saturation' */
      ESP32Arm6DOF_B.Saturation_d = ESP32Arm6DOF_DW.Integrator_DSTATE_k;
    }

    /* End of Saturate: '<S25>/Saturation' */

    /* MATLABSystem: '<Root>/Base Servo' */
    if (ESP32Arm6DOF_B.Saturation_d < 0.0) {
      tmp = 0U;
    } else if (ESP32Arm6DOF_B.Saturation_d > 180.0) {
      tmp = 180U;
    } else {
      rtb_Integrator_d = rt_roundd_snf(ESP32Arm6DOF_B.Saturation_d);
      if (rtb_Integrator_d < 256.0) {
        tmp = (uint8_T)rtb_Integrator_d;
      } else {
        tmp = MAX_uint8_T;
      }
    }

    MW_servoWrite(0, tmp);

    /* End of MATLABSystem: '<Root>/Base Servo' */

    /* MinMax: '<S19>/Max' incorporates:
     *  Constant: '<S19>/Time constant'
     */
    if ((ESP32Arm6DOF_B.Probe[0] >=
         ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_o) || rtIsNaN
        (ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_o)) {
      rtb_Integrator_d = ESP32Arm6DOF_B.Probe[0];
    } else {
      rtb_Integrator_d = ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_o;
    }

    /* End of MinMax: '<S19>/Max' */

    /* Fcn: '<S19>/Avoid Divide by Zero' */
    ESP32Arm6DOF_B.AvoidDividebyZero_k = (real_T)(rtb_Integrator_d == 0.0) *
      2.2204460492503131e-16 + rtb_Integrator_d;
  }

  /* Product: '<S4>/1//T' incorporates:
   *  Sum: '<S4>/Sum1'
   */
  ESP32Arm6DOF_B.uT_l = 1.0 / ESP32Arm6DOF_B.AvoidDividebyZero_k * (K -
    ESP32Arm6DOF_B.Saturation_d);

  /* Gain: '<S9>/K' */
  K = ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_h * ESP32Arm6DOF_B.ClawSignal;
  if (rtmIsMajorTimeStep(ESP32Arm6DOF_M)) {
    /* Logic: '<S54>/Logical Operator' incorporates:
     *  Constant: '<S54>/Constant'
     *  Constant: '<S54>/Time constant'
     *  Constant: '<S57>/Constant'
     *  Constant: '<S58>/Constant'
     *  RelationalOperator: '<S57>/Compare'
     *  RelationalOperator: '<S58>/Compare'
     *  Sum: '<S54>/Sum1'
     */
    rtb_LogicalOperator_g = ((ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_e -
      ESP32Arm6DOF_B.Probe_f[0] <= ESP32Arm6DOF_P.Constant_Value_p) &&
      (ESP32Arm6DOF_P.LowPassFilterDiscreteorConti_gi <
       ESP32Arm6DOF_P.CompareToConstant_const_k));

    /* DiscreteIntegrator: '<S60>/Integrator' */
    if (ESP32Arm6DOF_DW.Integrator_IC_LOADING_f != 0) {
      ESP32Arm6DOF_DW.Integrator_DSTATE_g = K;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE_g >
          ESP32Arm6DOF_P.Integrator_UpperSat_g) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_g =
          ESP32Arm6DOF_P.Integrator_UpperSat_g;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_g <
                 ESP32Arm6DOF_P.Integrator_LowerSat_n) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_g =
          ESP32Arm6DOF_P.Integrator_LowerSat_n;
      }
    }

