akbar-q/Matlab-Simulink/ESP32Arm6DOF_ert_rtw/ESP32Arm6DOF.c
    if (rtb_LogicalOperator_g || (ESP32Arm6DOF_DW.Integrator_PrevResetState_m !=
         0)) {
      ESP32Arm6DOF_DW.Integrator_DSTATE_g = K;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE_g >
          ESP32Arm6DOF_P.Integrator_UpperSat_g) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_g =
          ESP32Arm6DOF_P.Integrator_UpperSat_g;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_g <
                 ESP32Arm6DOF_P.Integrator_LowerSat_n) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_g =
          ESP32Arm6DOF_P.Integrator_LowerSat_n;
      }
    }

    /* Saturate: '<S60>/Saturation' incorporates:
     *  DiscreteIntegrator: '<S60>/Integrator'
     */
    if (ESP32Arm6DOF_DW.Integrator_DSTATE_g >
        ESP32Arm6DOF_P.Saturation_UpperSat_l) {
      /* Saturate: '<S60>/Saturation' */
      ESP32Arm6DOF_B.Saturation_n = ESP32Arm6DOF_P.Saturation_UpperSat_l;
    } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_g <
               ESP32Arm6DOF_P.Saturation_LowerSat_e) {
      /* Saturate: '<S60>/Saturation' */
      ESP32Arm6DOF_B.Saturation_n = ESP32Arm6DOF_P.Saturation_LowerSat_e;
    } else {
      /* Saturate: '<S60>/Saturation' */
      ESP32Arm6DOF_B.Saturation_n = ESP32Arm6DOF_DW.Integrator_DSTATE_g;
    }

    /* End of Saturate: '<S60>/Saturation' */

    /* MATLABSystem: '<Root>/Claw Servo' */
    if (ESP32Arm6DOF_B.Saturation_n < 0.0) {
      tmp = 0U;
    } else if (ESP32Arm6DOF_B.Saturation_n > 180.0) {
      tmp = 180U;
    } else {
      rtb_Integrator_d = rt_roundd_snf(ESP32Arm6DOF_B.Saturation_n);
      if (rtb_Integrator_d < 256.0) {
        tmp = (uint8_T)rtb_Integrator_d;
      } else {
        tmp = MAX_uint8_T;
      }
    }

    MW_servoWrite(1, tmp);

    /* End of MATLABSystem: '<Root>/Claw Servo' */

    /* MinMax: '<S54>/Max' incorporates:
     *  Constant: '<S54>/Time constant'
     */
    if ((ESP32Arm6DOF_B.Probe_f[0] >=
         ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_e) || rtIsNaN
        (ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_e)) {
      rtb_Integrator_d = ESP32Arm6DOF_B.Probe_f[0];
    } else {
      rtb_Integrator_d = ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_e;
    }

    /* End of MinMax: '<S54>/Max' */

    /* Fcn: '<S54>/Avoid Divide by Zero' */
    ESP32Arm6DOF_B.AvoidDividebyZero_l = (real_T)(rtb_Integrator_d == 0.0) *
      2.2204460492503131e-16 + rtb_Integrator_d;
  }

  /* Product: '<S9>/1//T' incorporates:
   *  Sum: '<S9>/Sum1'
   */
  ESP32Arm6DOF_B.uT_j = 1.0 / ESP32Arm6DOF_B.AvoidDividebyZero_l * (K -
    ESP32Arm6DOF_B.Saturation_n);

  /* Gain: '<S5>/K' */
  K = ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_j *
    ESP32Arm6DOF_B.LowerSignal;
  if (rtmIsMajorTimeStep(ESP32Arm6DOF_M)) {
    /* Logic: '<S26>/Logical Operator' incorporates:
     *  Constant: '<S26>/Constant'
     *  Constant: '<S26>/Time constant'
     *  Constant: '<S29>/Constant'
     *  Constant: '<S30>/Constant'
     *  RelationalOperator: '<S29>/Compare'
     *  RelationalOperator: '<S30>/Compare'
     *  Sum: '<S26>/Sum1'
     */
    rtb_LogicalOperator_k = ((ESP32Arm6DOF_P.LowPassFilterDiscreteorConti_jx -
      ESP32Arm6DOF_B.Probe_a[0] <= ESP32Arm6DOF_P.Constant_Value_b) &&
      (ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_m <
       ESP32Arm6DOF_P.CompareToConstant_const_m));

    /* DiscreteIntegrator: '<S32>/Integrator' */
    if (ESP32Arm6DOF_DW.Integrator_IC_LOADING_o != 0) {
      ESP32Arm6DOF_DW.Integrator_DSTATE_n = K;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE_n >
          ESP32Arm6DOF_P.Integrator_UpperSat_i) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_n =
          ESP32Arm6DOF_P.Integrator_UpperSat_i;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_n <
                 ESP32Arm6DOF_P.Integrator_LowerSat_b) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_n =
          ESP32Arm6DOF_P.Integrator_LowerSat_b;
      }
    }

    if (rtb_LogicalOperator_k || (ESP32Arm6DOF_DW.Integrator_PrevResetState_l !=
         0)) {
      ESP32Arm6DOF_DW.Integrator_DSTATE_n = K;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE_n >
          ESP32Arm6DOF_P.Integrator_UpperSat_i) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_n =
          ESP32Arm6DOF_P.Integrator_UpperSat_i;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_n <
                 ESP32Arm6DOF_P.Integrator_LowerSat_b) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_n =
          ESP32Arm6DOF_P.Integrator_LowerSat_b;
      }
    }

    /* Saturate: '<S32>/Saturation' incorporates:
     *  DiscreteIntegrator: '<S32>/Integrator'
     */
    if (ESP32Arm6DOF_DW.Integrator_DSTATE_n >
        ESP32Arm6DOF_P.Saturation_UpperSat_o) {
      /* Saturate: '<S32>/Saturation' */
      ESP32Arm6DOF_B.Saturation_nm = ESP32Arm6DOF_P.Saturation_UpperSat_o;
    } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_n <
               ESP32Arm6DOF_P.Saturation_LowerSat_k) {
      /* Saturate: '<S32>/Saturation' */
      ESP32Arm6DOF_B.Saturation_nm = ESP32Arm6DOF_P.Saturation_LowerSat_k;
    } else {
      /* Saturate: '<S32>/Saturation' */
      ESP32Arm6DOF_B.Saturation_nm = ESP32Arm6DOF_DW.Integrator_DSTATE_n;
    }

    /* End of Saturate: '<S32>/Saturation' */

    /* MATLABSystem: '<Root>/Lower Arm Servo' */
    if (ESP32Arm6DOF_B.Saturation_nm < 0.0) {
      tmp = 0U;
    } else if (ESP32Arm6DOF_B.Saturation_nm > 180.0) {
      tmp = 180U;
    } else {
      rtb_Integrator_d = rt_roundd_snf(ESP32Arm6DOF_B.Saturation_nm);
      if (rtb_Integrator_d < 256.0) {
        tmp = (uint8_T)rtb_Integrator_d;
      } else {
        tmp = MAX_uint8_T;
      }
    }

    MW_servoWrite(2, tmp);

    /* End of MATLABSystem: '<Root>/Lower Arm Servo' */

    /* MinMax: '<S26>/Max' incorporates:
     *  Constant: '<S26>/Time constant'
     */
    if ((ESP32Arm6DOF_B.Probe_a[0] >=
         ESP32Arm6DOF_P.LowPassFilterDiscreteorConti_jx) || rtIsNaN
        (ESP32Arm6DOF_P.LowPassFilterDiscreteorConti_jx)) {
      rtb_Integrator_d = ESP32Arm6DOF_B.Probe_a[0];
    } else {
      rtb_Integrator_d = ESP32Arm6DOF_P.LowPassFilterDiscreteorConti_jx;
    }

    /* End of MinMax: '<S26>/Max' */

    /* Fcn: '<S26>/Avoid Divide by Zero' */
    ESP32Arm6DOF_B.AvoidDividebyZero_c = (real_T)(rtb_Integrator_d == 0.0) *
      2.2204460492503131e-16 + rtb_Integrator_d;
  }

  /* Product: '<S5>/1//T' incorporates:
   *  Sum: '<S5>/Sum1'
   */
  ESP32Arm6DOF_B.uT_g = 1.0 / ESP32Arm6DOF_B.AvoidDividebyZero_c * (K -
    ESP32Arm6DOF_B.Saturation_nm);

  /* Gain: '<S6>/K' */
  K = ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_l * ESP32Arm6DOF_B.MidSignal;
  if (rtmIsMajorTimeStep(ESP32Arm6DOF_M)) {
    /* Logic: '<S33>/Logical Operator' incorporates:
     *  Constant: '<S33>/Constant'
     *  Constant: '<S33>/Time constant'
     *  Constant: '<S36>/Constant'
     *  Constant: '<S37>/Constant'
     *  RelationalOperator: '<S36>/Compare'
     *  RelationalOperator: '<S37>/Compare'
     *  Sum: '<S33>/Sum1'
     */
    rtb_LogicalOperator_gb = ((ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_d -
      ESP32Arm6DOF_B.Probe_e[0] <= ESP32Arm6DOF_P.Constant_Value_o) &&
      (ESP32Arm6DOF_P.LowPassFilterDiscreteorConti_fo <
       ESP32Arm6DOF_P.CompareToConstant_const_g));

    /* DiscreteIntegrator: '<S39>/Integrator' */
    if (ESP32Arm6DOF_DW.Integrator_IC_LOADING_n != 0) {
      ESP32Arm6DOF_DW.Integrator_DSTATE_c = K;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE_c >
          ESP32Arm6DOF_P.Integrator_UpperSat_p) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_c =
          ESP32Arm6DOF_P.Integrator_UpperSat_p;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_c <
                 ESP32Arm6DOF_P.Integrator_LowerSat_o) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_c =
          ESP32Arm6DOF_P.Integrator_LowerSat_o;
      }
    }

    if (rtb_LogicalOperator_gb || (ESP32Arm6DOF_DW.Integrator_PrevResetState_ah
         != 0)) {
      ESP32Arm6DOF_DW.Integrator_DSTATE_c = K;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE_c >
          ESP32Arm6DOF_P.Integrator_UpperSat_p) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_c =
          ESP32Arm6DOF_P.Integrator_UpperSat_p;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_c <
                 ESP32Arm6DOF_P.Integrator_LowerSat_o) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_c =
          ESP32Arm6DOF_P.Integrator_LowerSat_o;
      }
    }

