akbar-q/Matlab-Simulink/ESP32Arm6DOF_ert_rtw/ESP32Arm6DOF.c
    /* Saturate: '<S39>/Saturation' incorporates:
     *  DiscreteIntegrator: '<S39>/Integrator'
     */
    if (ESP32Arm6DOF_DW.Integrator_DSTATE_c >
        ESP32Arm6DOF_P.Saturation_UpperSat_g) {
      /* Saturate: '<S39>/Saturation' */
      ESP32Arm6DOF_B.Saturation_h = ESP32Arm6DOF_P.Saturation_UpperSat_g;
    } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_c <
               ESP32Arm6DOF_P.Saturation_LowerSat_dj) {
      /* Saturate: '<S39>/Saturation' */
      ESP32Arm6DOF_B.Saturation_h = ESP32Arm6DOF_P.Saturation_LowerSat_dj;
    } else {
      /* Saturate: '<S39>/Saturation' */
      ESP32Arm6DOF_B.Saturation_h = ESP32Arm6DOF_DW.Integrator_DSTATE_c;
    }

    /* End of Saturate: '<S39>/Saturation' */

    /* MATLABSystem: '<Root>/Mid Arm Servo' */
    if (ESP32Arm6DOF_B.Saturation_h < 0.0) {
      tmp = 0U;
    } else if (ESP32Arm6DOF_B.Saturation_h > 180.0) {
      tmp = 180U;
    } else {
      rtb_Integrator_d = rt_roundd_snf(ESP32Arm6DOF_B.Saturation_h);
      if (rtb_Integrator_d < 256.0) {
        tmp = (uint8_T)rtb_Integrator_d;
      } else {
        tmp = MAX_uint8_T;
      }
    }

    MW_servoWrite(3, tmp);

    /* End of MATLABSystem: '<Root>/Mid Arm Servo' */

    /* MinMax: '<S33>/Max' incorporates:
     *  Constant: '<S33>/Time constant'
     */
    if ((ESP32Arm6DOF_B.Probe_e[0] >=
         ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_d) || rtIsNaN
        (ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_d)) {
      rtb_Integrator_d = ESP32Arm6DOF_B.Probe_e[0];
    } else {
      rtb_Integrator_d = ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_d;
    }

    /* End of MinMax: '<S33>/Max' */

    /* Fcn: '<S33>/Avoid Divide by Zero' */
    ESP32Arm6DOF_B.AvoidDividebyZero_o = (real_T)(rtb_Integrator_d == 0.0) *
      2.2204460492503131e-16 + rtb_Integrator_d;
  }

  /* Product: '<S6>/1//T' incorporates:
   *  Sum: '<S6>/Sum1'
   */
  ESP32Arm6DOF_B.uT_f = 1.0 / ESP32Arm6DOF_B.AvoidDividebyZero_o * (K -
    ESP32Arm6DOF_B.Saturation_h);

  /* Gain: '<S8>/K' */
  K = ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_f *
    ESP32Arm6DOF_B.RotationSignal;
  if (rtmIsMajorTimeStep(ESP32Arm6DOF_M)) {
    /* Logic: '<S47>/Logical Operator' incorporates:
     *  Constant: '<S47>/Constant'
     *  Constant: '<S47>/Time constant'
     *  Constant: '<S50>/Constant'
     *  Constant: '<S51>/Constant'
     *  RelationalOperator: '<S50>/Compare'
     *  RelationalOperator: '<S51>/Compare'
     *  Sum: '<S47>/Sum1'
     */
    rtb_LogicalOperator_e = ((ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_i -
      ESP32Arm6DOF_B.Probe_m[0] <= ESP32Arm6DOF_P.Constant_Value_o1) &&
      (ESP32Arm6DOF_P.LowPassFilterDiscreteorConti_jr <
       ESP32Arm6DOF_P.CompareToConstant_const_f));

    /* DiscreteIntegrator: '<S53>/Integrator' */
    if (ESP32Arm6DOF_DW.Integrator_IC_LOADING_b != 0) {
      ESP32Arm6DOF_DW.Integrator_DSTATE_p = K;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE_p >
          ESP32Arm6DOF_P.Integrator_UpperSat_h) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_p =
          ESP32Arm6DOF_P.Integrator_UpperSat_h;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_p <
                 ESP32Arm6DOF_P.Integrator_LowerSat_be) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_p =
          ESP32Arm6DOF_P.Integrator_LowerSat_be;
      }
    }

    if (rtb_LogicalOperator_e || (ESP32Arm6DOF_DW.Integrator_PrevResetState_d !=
         0)) {
      ESP32Arm6DOF_DW.Integrator_DSTATE_p = K;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE_p >
          ESP32Arm6DOF_P.Integrator_UpperSat_h) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_p =
          ESP32Arm6DOF_P.Integrator_UpperSat_h;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_p <
                 ESP32Arm6DOF_P.Integrator_LowerSat_be) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_p =
          ESP32Arm6DOF_P.Integrator_LowerSat_be;
      }
    }

    /* Saturate: '<S53>/Saturation' incorporates:
     *  DiscreteIntegrator: '<S53>/Integrator'
     */
    if (ESP32Arm6DOF_DW.Integrator_DSTATE_p >
        ESP32Arm6DOF_P.Saturation_UpperSat_e) {
      /* Saturate: '<S53>/Saturation' */
      ESP32Arm6DOF_B.Saturation_i = ESP32Arm6DOF_P.Saturation_UpperSat_e;
    } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_p <
               ESP32Arm6DOF_P.Saturation_LowerSat_n) {
      /* Saturate: '<S53>/Saturation' */
      ESP32Arm6DOF_B.Saturation_i = ESP32Arm6DOF_P.Saturation_LowerSat_n;
    } else {
      /* Saturate: '<S53>/Saturation' */
      ESP32Arm6DOF_B.Saturation_i = ESP32Arm6DOF_DW.Integrator_DSTATE_p;
    }

    /* End of Saturate: '<S53>/Saturation' */

    /* MATLABSystem: '<Root>/Rotation Servo' */
    if (ESP32Arm6DOF_B.Saturation_i < 0.0) {
      tmp = 0U;
    } else if (ESP32Arm6DOF_B.Saturation_i > 180.0) {
      tmp = 180U;
    } else {
      rtb_Integrator_d = rt_roundd_snf(ESP32Arm6DOF_B.Saturation_i);
      if (rtb_Integrator_d < 256.0) {
        tmp = (uint8_T)rtb_Integrator_d;
      } else {
        tmp = MAX_uint8_T;
      }
    }

    MW_servoWrite(4, tmp);

    /* End of MATLABSystem: '<Root>/Rotation Servo' */

    /* MinMax: '<S47>/Max' incorporates:
     *  Constant: '<S47>/Time constant'
     */
    if ((ESP32Arm6DOF_B.Probe_m[0] >=
         ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_i) || rtIsNaN
        (ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_i)) {
      rtb_Integrator_d = ESP32Arm6DOF_B.Probe_m[0];
    } else {
      rtb_Integrator_d = ESP32Arm6DOF_P.LowPassFilterDiscreteorContin_i;
    }

    /* End of MinMax: '<S47>/Max' */

    /* Fcn: '<S47>/Avoid Divide by Zero' */
    ESP32Arm6DOF_B.AvoidDividebyZero_h = (real_T)(rtb_Integrator_d == 0.0) *
      2.2204460492503131e-16 + rtb_Integrator_d;
  }

  /* Product: '<S8>/1//T' incorporates:
   *  Sum: '<S8>/Sum1'
   */
  ESP32Arm6DOF_B.uT_gp = 1.0 / ESP32Arm6DOF_B.AvoidDividebyZero_h * (K -
    ESP32Arm6DOF_B.Saturation_i);
  if (rtmIsMajorTimeStep(ESP32Arm6DOF_M)) {
    /* MATLABSystem: '<Root>/VL53L0X Time Of Flight Sensor' */
    if (ESP32Arm6DOF_DW.obj_i.SampleTime !=
        ESP32Arm6DOF_P.VL53L0XTimeOfFlightSensor_Sampl) {
      ESP32Arm6DOF_DW.obj_i.SampleTime =
        ESP32Arm6DOF_P.VL53L0XTimeOfFlightSensor_Sampl;
    }

    y = calculateRange();

    /* Outputs for Triggered SubSystem: '<Root>/Sample and Hold' incorporates:
     *  TriggerPort: '<S11>/Trigger'
     */
    if (rtsiIsModeUpdateTimeStep(&ESP32Arm6DOF_M->solverInfo)) {
      /* RelationalOperator: '<Root>/If 50 is Bigger Than Sensor' incorporates:
       *  Constant: '<Root>/Constant2'
       *  MATLABSystem: '<Root>/VL53L0X Time Of Flight Sensor'
       */
      ESP32Arm6DOF_PrevZCX.SampleandHold_Trig_ZCE = (ZCSigState)
        (ESP32Arm6DOF_P.Constant2_Value > y);
    }

    /* End of Outputs for SubSystem: '<Root>/Sample and Hold' */

    /* Gain: '<S87>/Derivative Gain' */
    ESP32Arm6DOF_B.DerivativeGain = ESP32Arm6DOF_P.PIDController_D * 0.0;
  }

