akbar-q/Matlab-Simulink/ESP32Arm6DOF_ert_rtw/ESP32Arm6DOF.c
  /* Gain: '<S97>/Filter Coefficient' incorporates:
   *  Integrator: '<S89>/Filter'
   *  Sum: '<S89>/SumD'
   */
  ESP32Arm6DOF_B.FilterCoefficient = (ESP32Arm6DOF_B.DerivativeGain -
    ESP32Arm6DOF_X.Filter_CSTATE) * ESP32Arm6DOF_P.PIDController_N;
  if (rtmIsMajorTimeStep(ESP32Arm6DOF_M)) {
    /* Gain: '<S91>/Integral Gain' */
    ESP32Arm6DOF_B.IntegralGain = ESP32Arm6DOF_P.PIDController_I * 0.0;

    /* MATLABSystem: '<Root>/VL53L0X Time Of Flight Sensor.' */
    if (ESP32Arm6DOF_DW.obj.SampleTime !=
        ESP32Arm6DOF_P.VL53L0XTimeOfFlightSensor_Sam_e) {
      ESP32Arm6DOF_DW.obj.SampleTime =
        ESP32Arm6DOF_P.VL53L0XTimeOfFlightSensor_Sam_e;
    }

    calculateRange();

    /* End of MATLABSystem: '<Root>/VL53L0X Time Of Flight Sensor.' */

    /* MATLABSystem: '<Root>/Standard Servo Write.' */
    MW_servoWrite(5, 0);

    /* S-Function (saeroclockpacer): '<Root>/Simulation Pace.' */
    /*
     * The Clock Pacer generates no code, it is only active in
     * interpreted simulation.
     */
  }

  if (rtmIsMajorTimeStep(ESP32Arm6DOF_M)) {
    if (rtmIsMajorTimeStep(ESP32Arm6DOF_M)) {
      /* Update for DiscreteIntegrator: '<S46>/Integrator' */
      ESP32Arm6DOF_DW.Integrator_IC_LOADING = 0U;
      ESP32Arm6DOF_DW.Integrator_DSTATE += ESP32Arm6DOF_P.Integrator_gainval *
        ESP32Arm6DOF_B.uT;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE > ESP32Arm6DOF_P.Integrator_UpperSat)
      {
        ESP32Arm6DOF_DW.Integrator_DSTATE = ESP32Arm6DOF_P.Integrator_UpperSat;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE <
                 ESP32Arm6DOF_P.Integrator_LowerSat) {
        ESP32Arm6DOF_DW.Integrator_DSTATE = ESP32Arm6DOF_P.Integrator_LowerSat;
      }

      ESP32Arm6DOF_DW.Integrator_PrevResetState = (int8_T)rtb_LogicalOperator;

      /* End of Update for DiscreteIntegrator: '<S46>/Integrator' */

      /* Update for DiscreteIntegrator: '<S25>/Integrator' */
      ESP32Arm6DOF_DW.Integrator_IC_LOADING_l = 0U;
      ESP32Arm6DOF_DW.Integrator_DSTATE_k += ESP32Arm6DOF_P.Integrator_gainval_j
        * ESP32Arm6DOF_B.uT_l;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE_k >
          ESP32Arm6DOF_P.Integrator_UpperSat_f) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_k =
          ESP32Arm6DOF_P.Integrator_UpperSat_f;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_k <
                 ESP32Arm6DOF_P.Integrator_LowerSat_f) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_k =
          ESP32Arm6DOF_P.Integrator_LowerSat_f;
      }

      ESP32Arm6DOF_DW.Integrator_PrevResetState_a = (int8_T)
        rtb_LogicalOperator_h;

      /* End of Update for DiscreteIntegrator: '<S25>/Integrator' */

      /* Update for DiscreteIntegrator: '<S60>/Integrator' */
      ESP32Arm6DOF_DW.Integrator_IC_LOADING_f = 0U;
      ESP32Arm6DOF_DW.Integrator_DSTATE_g += ESP32Arm6DOF_P.Integrator_gainval_g
        * ESP32Arm6DOF_B.uT_j;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE_g >
          ESP32Arm6DOF_P.Integrator_UpperSat_g) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_g =
          ESP32Arm6DOF_P.Integrator_UpperSat_g;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_g <
                 ESP32Arm6DOF_P.Integrator_LowerSat_n) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_g =
          ESP32Arm6DOF_P.Integrator_LowerSat_n;
      }

      ESP32Arm6DOF_DW.Integrator_PrevResetState_m = (int8_T)
        rtb_LogicalOperator_g;

      /* End of Update for DiscreteIntegrator: '<S60>/Integrator' */

      /* Update for DiscreteIntegrator: '<S32>/Integrator' */
      ESP32Arm6DOF_DW.Integrator_IC_LOADING_o = 0U;
      ESP32Arm6DOF_DW.Integrator_DSTATE_n += ESP32Arm6DOF_P.Integrator_gainval_c
        * ESP32Arm6DOF_B.uT_g;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE_n >
          ESP32Arm6DOF_P.Integrator_UpperSat_i) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_n =
          ESP32Arm6DOF_P.Integrator_UpperSat_i;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_n <
                 ESP32Arm6DOF_P.Integrator_LowerSat_b) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_n =
          ESP32Arm6DOF_P.Integrator_LowerSat_b;
      }

      ESP32Arm6DOF_DW.Integrator_PrevResetState_l = (int8_T)
        rtb_LogicalOperator_k;

      /* End of Update for DiscreteIntegrator: '<S32>/Integrator' */

      /* Update for DiscreteIntegrator: '<S39>/Integrator' */
      ESP32Arm6DOF_DW.Integrator_IC_LOADING_n = 0U;
      ESP32Arm6DOF_DW.Integrator_DSTATE_c += ESP32Arm6DOF_P.Integrator_gainval_k
        * ESP32Arm6DOF_B.uT_f;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE_c >
          ESP32Arm6DOF_P.Integrator_UpperSat_p) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_c =
          ESP32Arm6DOF_P.Integrator_UpperSat_p;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_c <
                 ESP32Arm6DOF_P.Integrator_LowerSat_o) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_c =
          ESP32Arm6DOF_P.Integrator_LowerSat_o;
      }

      ESP32Arm6DOF_DW.Integrator_PrevResetState_ah = (int8_T)
        rtb_LogicalOperator_gb;

      /* End of Update for DiscreteIntegrator: '<S39>/Integrator' */

      /* Update for DiscreteIntegrator: '<S53>/Integrator' */
      ESP32Arm6DOF_DW.Integrator_IC_LOADING_b = 0U;
      ESP32Arm6DOF_DW.Integrator_DSTATE_p += ESP32Arm6DOF_P.Integrator_gainval_n
        * ESP32Arm6DOF_B.uT_gp;
      if (ESP32Arm6DOF_DW.Integrator_DSTATE_p >
          ESP32Arm6DOF_P.Integrator_UpperSat_h) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_p =
          ESP32Arm6DOF_P.Integrator_UpperSat_h;
      } else if (ESP32Arm6DOF_DW.Integrator_DSTATE_p <
                 ESP32Arm6DOF_P.Integrator_LowerSat_be) {
        ESP32Arm6DOF_DW.Integrator_DSTATE_p =
          ESP32Arm6DOF_P.Integrator_LowerSat_be;
      }

      ESP32Arm6DOF_DW.Integrator_PrevResetState_d = (int8_T)
        rtb_LogicalOperator_e;

      /* End of Update for DiscreteIntegrator: '<S53>/Integrator' */
    }
  }                                    /* end MajorTimeStep */

  if (rtmIsMajorTimeStep(ESP32Arm6DOF_M)) {
    rt_ertODEUpdateContinuousStates(&ESP32Arm6DOF_M->solverInfo);

    /* Update absolute time for base rate */
    /* The "clockTick0" counts the number of times the code of this task has
     * been executed. The absolute time is the multiplication of "clockTick0"
     * and "Timing.stepSize0". Size of "clockTick0" ensures timer will not
     * overflow during the application lifespan selected.
     */
    ++ESP32Arm6DOF_M->Timing.clockTick0;
    ESP32Arm6DOF_M->Timing.t[0] = rtsiGetSolverStopTime
      (&ESP32Arm6DOF_M->solverInfo);

    {
      /* Update absolute timer for sample time: [0.033333333333333333s, 0.0s] */
      /* The "clockTick1" counts the number of times the code of this task has
       * been executed. The resolution of this integer timer is 0.033333333333333333, which is the step size
       * of the task. Size of "clockTick1" ensures timer will not overflow during the
       * application lifespan selected.
       */
      ESP32Arm6DOF_M->Timing.clockTick1++;
    }
  }                                    /* end MajorTimeStep */
}

/* Derivatives for root system: '<Root>' */
void ESP32Arm6DOF_derivatives(void)
{
  XDot_ESP32Arm6DOF_T *_rtXdot;
  _rtXdot = ((XDot_ESP32Arm6DOF_T *) ESP32Arm6DOF_M->derivs);

