akbar-q/Matlab-Simulink/ESP32Arm6DOF_ert_rtw/ESP32Arm6DOF.c
  /* Derivatives for Integrator: '<S89>/Filter' */
  _rtXdot->Filter_CSTATE = ESP32Arm6DOF_B.FilterCoefficient;

  /* Derivatives for Integrator: '<S94>/Integrator' */
  _rtXdot->Integrator_CSTATE = ESP32Arm6DOF_B.IntegralGain;
}

/* Model initialize function */
void ESP32Arm6DOF_initialize(void)
{
  /* Registration code */

  /* initialize non-finites */
  rt_InitInfAndNaN(sizeof(real_T));

  /* non-finite (run-time) assignments */
  ESP32Arm6DOF_P.Integrator_UpperSat = rtInf;
  ESP32Arm6DOF_P.Integrator_LowerSat = rtMinusInf;
  ESP32Arm6DOF_P.Saturation_UpperSat = rtInf;
  ESP32Arm6DOF_P.Saturation_LowerSat = rtMinusInf;
  ESP32Arm6DOF_P.Integrator_UpperSat_f = rtInf;
  ESP32Arm6DOF_P.Integrator_LowerSat_f = rtMinusInf;
  ESP32Arm6DOF_P.Saturation_UpperSat_b = rtInf;
  ESP32Arm6DOF_P.Saturation_LowerSat_d = rtMinusInf;
  ESP32Arm6DOF_P.Integrator_UpperSat_g = rtInf;
  ESP32Arm6DOF_P.Integrator_LowerSat_n = rtMinusInf;
  ESP32Arm6DOF_P.Saturation_UpperSat_l = rtInf;
  ESP32Arm6DOF_P.Saturation_LowerSat_e = rtMinusInf;
  ESP32Arm6DOF_P.Integrator_UpperSat_i = rtInf;
  ESP32Arm6DOF_P.Integrator_LowerSat_b = rtMinusInf;
  ESP32Arm6DOF_P.Saturation_UpperSat_o = rtInf;
  ESP32Arm6DOF_P.Saturation_LowerSat_k = rtMinusInf;
  ESP32Arm6DOF_P.Integrator_UpperSat_p = rtInf;
  ESP32Arm6DOF_P.Integrator_LowerSat_o = rtMinusInf;
  ESP32Arm6DOF_P.Saturation_UpperSat_g = rtInf;
  ESP32Arm6DOF_P.Saturation_LowerSat_dj = rtMinusInf;
  ESP32Arm6DOF_P.Integrator_UpperSat_h = rtInf;
  ESP32Arm6DOF_P.Integrator_LowerSat_be = rtMinusInf;
  ESP32Arm6DOF_P.Saturation_UpperSat_e = rtInf;
  ESP32Arm6DOF_P.Saturation_LowerSat_n = rtMinusInf;

  {
    /* Setup solver object */
    rtsiSetSimTimeStepPtr(&ESP32Arm6DOF_M->solverInfo,
                          &ESP32Arm6DOF_M->Timing.simTimeStep);
    rtsiSetTPtr(&ESP32Arm6DOF_M->solverInfo, &rtmGetTPtr(ESP32Arm6DOF_M));
    rtsiSetStepSizePtr(&ESP32Arm6DOF_M->solverInfo,
                       &ESP32Arm6DOF_M->Timing.stepSize0);
    rtsiSetdXPtr(&ESP32Arm6DOF_M->solverInfo, &ESP32Arm6DOF_M->derivs);
    rtsiSetContStatesPtr(&ESP32Arm6DOF_M->solverInfo, (real_T **)
                         &ESP32Arm6DOF_M->contStates);
    rtsiSetNumContStatesPtr(&ESP32Arm6DOF_M->solverInfo,
      &ESP32Arm6DOF_M->Sizes.numContStates);
    rtsiSetNumPeriodicContStatesPtr(&ESP32Arm6DOF_M->solverInfo,
      &ESP32Arm6DOF_M->Sizes.numPeriodicContStates);
    rtsiSetPeriodicContStateIndicesPtr(&ESP32Arm6DOF_M->solverInfo,
      &ESP32Arm6DOF_M->periodicContStateIndices);
    rtsiSetPeriodicContStateRangesPtr(&ESP32Arm6DOF_M->solverInfo,
      &ESP32Arm6DOF_M->periodicContStateRanges);
    rtsiSetContStateDisabledPtr(&ESP32Arm6DOF_M->solverInfo, (boolean_T**)
      &ESP32Arm6DOF_M->contStateDisabled);
    rtsiSetErrorStatusPtr(&ESP32Arm6DOF_M->solverInfo, (&rtmGetErrorStatus
      (ESP32Arm6DOF_M)));
    rtsiSetRTModelPtr(&ESP32Arm6DOF_M->solverInfo, ESP32Arm6DOF_M);
  }

  rtsiSetSimTimeStep(&ESP32Arm6DOF_M->solverInfo, MAJOR_TIME_STEP);
  rtsiSetIsMinorTimeStepWithModeChange(&ESP32Arm6DOF_M->solverInfo, false);
  rtsiSetIsContModeFrozen(&ESP32Arm6DOF_M->solverInfo, false);
  ESP32Arm6DOF_M->intgData.y = ESP32Arm6DOF_M->odeY;
  ESP32Arm6DOF_M->intgData.f[0] = ESP32Arm6DOF_M->odeF[0];
  ESP32Arm6DOF_M->intgData.f[1] = ESP32Arm6DOF_M->odeF[1];
  ESP32Arm6DOF_M->intgData.f[2] = ESP32Arm6DOF_M->odeF[2];
  ESP32Arm6DOF_M->contStates = ((X_ESP32Arm6DOF_T *) &ESP32Arm6DOF_X);
  ESP32Arm6DOF_M->contStateDisabled = ((XDis_ESP32Arm6DOF_T *)
    &ESP32Arm6DOF_XDis);
  ESP32Arm6DOF_M->Timing.tStart = (0.0);
  rtsiSetSolverData(&ESP32Arm6DOF_M->solverInfo, (void *)
                    &ESP32Arm6DOF_M->intgData);
  rtsiSetSolverName(&ESP32Arm6DOF_M->solverInfo,"ode3");
  rtmSetTPtr(ESP32Arm6DOF_M, &ESP32Arm6DOF_M->Timing.tArray[0]);
  ESP32Arm6DOF_M->Timing.stepSize0 = 0.033333333333333333;

  {
    int32_T i;
    char_T b[7];
    static const char_T b_0[7] = { 'D', 'e', 'f', 'a', 'u', 'l', 't' };

    /* Start for Probe: '<S19>/Probe' */
    ESP32Arm6DOF_B.Probe[0] = 0.033333333333333333;
    ESP32Arm6DOF_B.Probe[1] = 0.0;

    /* Start for Probe: '<S54>/Probe' */
    ESP32Arm6DOF_B.Probe_f[0] = 0.033333333333333333;
    ESP32Arm6DOF_B.Probe_f[1] = 0.0;

    /* Start for Probe: '<S26>/Probe' */
    ESP32Arm6DOF_B.Probe_a[0] = 0.033333333333333333;
    ESP32Arm6DOF_B.Probe_a[1] = 0.0;

    /* Start for Probe: '<S33>/Probe' */
    ESP32Arm6DOF_B.Probe_e[0] = 0.033333333333333333;
    ESP32Arm6DOF_B.Probe_e[1] = 0.0;

    /* Start for Probe: '<S47>/Probe' */
    ESP32Arm6DOF_B.Probe_m[0] = 0.033333333333333333;
    ESP32Arm6DOF_B.Probe_m[1] = 0.0;

    /* Start for Probe: '<S40>/Probe' */
    ESP32Arm6DOF_B.Probe_fr[0] = 0.033333333333333333;
    ESP32Arm6DOF_B.Probe_fr[1] = 0.0;
    ESP32Arm6DOF_PrevZCX.SampleandHold_Trig_ZCE = POS_ZCSIG;

    /* InitializeConditions for DiscreteIntegrator: '<S46>/Integrator' */
    ESP32Arm6DOF_DW.Integrator_IC_LOADING = 1U;

    /* InitializeConditions for DiscreteIntegrator: '<S25>/Integrator' */
    ESP32Arm6DOF_DW.Integrator_IC_LOADING_l = 1U;

    /* InitializeConditions for DiscreteIntegrator: '<S60>/Integrator' */
    ESP32Arm6DOF_DW.Integrator_IC_LOADING_f = 1U;

    /* InitializeConditions for DiscreteIntegrator: '<S32>/Integrator' */
    ESP32Arm6DOF_DW.Integrator_IC_LOADING_o = 1U;

    /* InitializeConditions for DiscreteIntegrator: '<S39>/Integrator' */
    ESP32Arm6DOF_DW.Integrator_IC_LOADING_n = 1U;

    /* InitializeConditions for DiscreteIntegrator: '<S53>/Integrator' */
    ESP32Arm6DOF_DW.Integrator_IC_LOADING_b = 1U;

    /* InitializeConditions for Integrator: '<S89>/Filter' */
    ESP32Arm6DOF_X.Filter_CSTATE =
      ESP32Arm6DOF_P.PIDController_InitialConditionF;

    /* InitializeConditions for Integrator: '<S94>/Integrator' */
    ESP32Arm6DOF_X.Integrator_CSTATE =
      ESP32Arm6DOF_P.PIDController_InitialConditio_l;

    /* SystemInitialize for Enabled SubSystem: '<Root>/Enabled Subsystem' */
    /* Start for FromWorkspace: '<S13>/fromWS_Signal 1' */
    {
      static real_T pTimeValues0[] = { 0.0, 0.5, 1.0, 1.5, 2.0, 2.5, 3.0, 3.5,
        4.0, 4.5, 5.0, 5.5, 6.0 } ;

