akbar-q/Matlab-Simulink/ESP32Arm6DOF_ert_rtw/ESP32Arm6DOF.c
      static real_T pDataValues0[] = { 90.0, 180.0, 180.0, 180.0, 180.0, 180.0,
        180.0, 90.0, 90.0, 90.0, 90.0, 90.0, 90.0 } ;

      ESP32Arm6DOF_DW.fromWS_Signal1_PWORK.TimePtr = (void *) pTimeValues0;
      ESP32Arm6DOF_DW.fromWS_Signal1_PWORK.DataPtr = (void *) pDataValues0;
      ESP32Arm6DOF_DW.fromWS_Signal1_IWORK.PrevIndex = 0;
    }

    /* Start for FromWorkspace: '<S15>/fromWS_Signal 1' */
    {
      static real_T pTimeValues0[] = { 0.0, 0.5, 1.0, 1.5, 2.0, 2.5, 3.0, 3.5,
        4.0, 4.5, 5.0, 5.5, 6.0 } ;

      static real_T pDataValues0[] = { 120.0, 120.0, 120.0, 120.0, 120.0, 120.0,
        120.0, 120.0, 120.0, 120.0, 120.0, 120.0, 120.0 } ;

      ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_p.TimePtr = (void *) pTimeValues0;
      ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_p.DataPtr = (void *) pDataValues0;
      ESP32Arm6DOF_DW.fromWS_Signal1_IWORK_k.PrevIndex = 0;
    }

    /* Start for FromWorkspace: '<S16>/fromWS_Signal 1' */
    {
      static real_T pTimeValues0[] = { 0.0, 0.5, 1.0, 1.5, 2.0, 2.5, 3.0, 3.5,
        4.0, 4.5, 5.0, 5.5, 6.0 } ;

      static real_T pDataValues0[] = { 150.0, 150.0, 70.0, 70.0, 70.0, 150.0,
        150.0, 150.0, 70.0, 70.0, 70.0, 150.0, 150.0 } ;

      ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_n.TimePtr = (void *) pTimeValues0;
      ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_n.DataPtr = (void *) pDataValues0;
      ESP32Arm6DOF_DW.fromWS_Signal1_IWORK_i.PrevIndex = 0;
    }

    /* Start for FromWorkspace: '<S18>/fromWS_Signal 1' */
    {
      static real_T pTimeValues0[] = { 0.0, 0.5, 1.0, 1.5, 2.0, 2.5, 3.0, 3.5,
        4.0, 4.5, 5.0, 5.5, 6.0 } ;

      static real_T pDataValues0[] = { 120.0, 120.0, 120.0, 85.0, 85.0, 120.0,
        120.0, 120.0, 120.0, 85.0, 85.0, 120.0, 120.0 } ;

      ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_d.TimePtr = (void *) pTimeValues0;
      ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_d.DataPtr = (void *) pDataValues0;
      ESP32Arm6DOF_DW.fromWS_Signal1_IWORK_l.PrevIndex = 0;
    }

    /* Start for FromWorkspace: '<S17>/fromWS_Signal 1' */
    {
      static real_T pTimeValues0[] = { 0.0, 0.5, 1.0, 1.5, 2.0, 2.5, 3.0, 3.5,
        4.0, 4.5, 5.0, 5.5, 6.0 } ;

      static real_T pDataValues0[] = { 60.0, 60.0, 60.0, 60.0, 60.0, 60.0, 60.0,
        60.0, 60.0, 60.0, 60.0, 60.0, 60.0 } ;

      ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_f.TimePtr = (void *) pTimeValues0;
      ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_f.DataPtr = (void *) pDataValues0;
      ESP32Arm6DOF_DW.fromWS_Signal1_IWORK_ko.PrevIndex = 0;
    }

    /* Start for FromWorkspace: '<S14>/fromWS_Signal 1' */
    {
      static real_T pTimeValues0[] = { 0.0, 0.5, 1.0, 1.5, 2.0, 2.5, 3.0, 3.5,
        4.0, 4.5, 5.0, 5.5, 6.0 } ;

      static real_T pDataValues0[] = { 0.0, 0.0, 0.0, 0.0, 180.0, 180.0, 180.0,
        180.0, 180.0, 180.0, 0.0, 0.0, 0.0 } ;

      ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_nz.TimePtr = (void *) pTimeValues0;
      ESP32Arm6DOF_DW.fromWS_Signal1_PWORK_nz.DataPtr = (void *) pDataValues0;
      ESP32Arm6DOF_DW.fromWS_Signal1_IWORK_a.PrevIndex = 0;
    }

    /* SystemInitialize for FromWorkspace: '<S13>/fromWS_Signal 1' incorporates:
     *  Outport: '<S2>/Out1'
     */
    ESP32Arm6DOF_B.BaseSig = ESP32Arm6DOF_P.Out1_Y0;

    /* SystemInitialize for FromWorkspace: '<S15>/fromWS_Signal 1' incorporates:
     *  Outport: '<S2>/Out2'
     */
    ESP32Arm6DOF_B.LowerSignal = ESP32Arm6DOF_P.Out2_Y0;

    /* SystemInitialize for FromWorkspace: '<S16>/fromWS_Signal 1' incorporates:
     *  Outport: '<S2>/Out3'
     */
    ESP32Arm6DOF_B.MidSignal = ESP32Arm6DOF_P.Out3_Y0;

    /* SystemInitialize for FromWorkspace: '<S18>/fromWS_Signal 1' incorporates:
     *  Outport: '<S2>/Out4'
     */
    ESP32Arm6DOF_B.UpperSignal = ESP32Arm6DOF_P.Out4_Y0;

    /* SystemInitialize for FromWorkspace: '<S17>/fromWS_Signal 1' incorporates:
     *  Outport: '<S2>/Out5'
     */
    ESP32Arm6DOF_B.RotationSignal = ESP32Arm6DOF_P.Out5_Y0;

    /* SystemInitialize for FromWorkspace: '<S14>/fromWS_Signal 1' incorporates:
     *  Outport: '<S2>/Out6'
     */
    ESP32Arm6DOF_B.ClawSignal = ESP32Arm6DOF_P.Out6_Y0;

    /* End of SystemInitialize for SubSystem: '<Root>/Enabled Subsystem' */

    /* Start for MATLABSystem: '<Root>/Upper Servo' */
    ESP32Arm6DOF_DW.obj_b.matlabCodegenIsDeleted = false;
    ESP32Arm6DOF_DW.obj_b.isInitialized = 1;
    MW_servoAttach(6, 32);
    ESP32Arm6DOF_DW.obj_b.isSetupComplete = true;

    /* Start for MATLABSystem: '<Root>/Base Servo' */
    ESP32Arm6DOF_DW.obj_h5.matlabCodegenIsDeleted = false;
    ESP32Arm6DOF_DW.obj_h5.isInitialized = 1;
    MW_servoAttach(0, 33);
    ESP32Arm6DOF_DW.obj_h5.isSetupComplete = true;

    /* Start for MATLABSystem: '<Root>/Claw Servo' */
    ESP32Arm6DOF_DW.obj_a.matlabCodegenIsDeleted = false;
    ESP32Arm6DOF_DW.obj_a.isInitialized = 1;
    MW_servoAttach(1, 12);
    ESP32Arm6DOF_DW.obj_a.isSetupComplete = true;

    /* Start for MATLABSystem: '<Root>/Lower Arm Servo' */
    ESP32Arm6DOF_DW.obj_h.matlabCodegenIsDeleted = false;
    ESP32Arm6DOF_DW.obj_h.isInitialized = 1;
    MW_servoAttach(2, 26);
    ESP32Arm6DOF_DW.obj_h.isSetupComplete = true;

    /* Start for MATLABSystem: '<Root>/Mid Arm Servo' */
    ESP32Arm6DOF_DW.obj_j.matlabCodegenIsDeleted = false;
    ESP32Arm6DOF_DW.obj_j.isInitialized = 1;
    MW_servoAttach(3, 18);
    ESP32Arm6DOF_DW.obj_j.isSetupComplete = true;

    /* Start for MATLABSystem: '<Root>/Rotation Servo' */
    ESP32Arm6DOF_DW.obj_l.matlabCodegenIsDeleted = false;
    ESP32Arm6DOF_DW.obj_l.isInitialized = 1;
    MW_servoAttach(4, 13);
    ESP32Arm6DOF_DW.obj_l.isSetupComplete = true;

    /* Start for MATLABSystem: '<Root>/VL53L0X Time Of Flight Sensor' */
    ESP32Arm6DOF_DW.obj_i.matlabCodegenIsDeleted = false;
    ESP32Arm6DOF_DW.obj_i.SampleTime =
      ESP32Arm6DOF_P.VL53L0XTimeOfFlightSensor_Sampl;
    ESP32Arm6DOF_DW.obj_i.isInitialized = 1;
    for (i = 0; i < 7; i++) {
      b[i] = b_0[i];
    }

    initializeVL53L0X(41, 0U, &b[0]);
    ESP32Arm6DOF_DW.obj_i.isSetupComplete = true;

    /* End of Start for MATLABSystem: '<Root>/VL53L0X Time Of Flight Sensor' */

