akbar-q/Matlab-Simulink/ESP32Arm6DOF_ert_rtw/ESP32Arm6DOF.c
    /* Start for MATLABSystem: '<Root>/VL53L0X Time Of Flight Sensor.' */
    ESP32Arm6DOF_DW.obj.matlabCodegenIsDeleted = false;
    ESP32Arm6DOF_DW.obj.SampleTime =
      ESP32Arm6DOF_P.VL53L0XTimeOfFlightSensor_Sam_e;
    ESP32Arm6DOF_DW.obj.isInitialized = 1;
    for (i = 0; i < 7; i++) {
      b[i] = b_0[i];
    }

    initializeVL53L0X(39, 0U, &b[0]);
    ESP32Arm6DOF_DW.obj.isSetupComplete = true;

    /* End of Start for MATLABSystem: '<Root>/VL53L0X Time Of Flight Sensor.' */

    /* Start for MATLABSystem: '<Root>/Standard Servo Write.' */
    ESP32Arm6DOF_DW.obj_g.matlabCodegenIsDeleted = false;
    ESP32Arm6DOF_DW.obj_g.isInitialized = 1;
    MW_servoAttach(5, 5);
    ESP32Arm6DOF_DW.obj_g.isSetupComplete = true;
  }
}

/* Model terminate function */
void ESP32Arm6DOF_terminate(void)
{
  /* Terminate for MATLABSystem: '<Root>/Upper Servo' */
  if (!ESP32Arm6DOF_DW.obj_b.matlabCodegenIsDeleted) {
    ESP32Arm6DOF_DW.obj_b.matlabCodegenIsDeleted = true;
  }

  /* End of Terminate for MATLABSystem: '<Root>/Upper Servo' */

  /* Terminate for MATLABSystem: '<Root>/Base Servo' */
  if (!ESP32Arm6DOF_DW.obj_h5.matlabCodegenIsDeleted) {
    ESP32Arm6DOF_DW.obj_h5.matlabCodegenIsDeleted = true;
  }

  /* End of Terminate for MATLABSystem: '<Root>/Base Servo' */

  /* Terminate for MATLABSystem: '<Root>/Claw Servo' */
  if (!ESP32Arm6DOF_DW.obj_a.matlabCodegenIsDeleted) {
    ESP32Arm6DOF_DW.obj_a.matlabCodegenIsDeleted = true;
  }

  /* End of Terminate for MATLABSystem: '<Root>/Claw Servo' */

  /* Terminate for MATLABSystem: '<Root>/Lower Arm Servo' */
  if (!ESP32Arm6DOF_DW.obj_h.matlabCodegenIsDeleted) {
    ESP32Arm6DOF_DW.obj_h.matlabCodegenIsDeleted = true;
  }

  /* End of Terminate for MATLABSystem: '<Root>/Lower Arm Servo' */

  /* Terminate for MATLABSystem: '<Root>/Mid Arm Servo' */
  if (!ESP32Arm6DOF_DW.obj_j.matlabCodegenIsDeleted) {
    ESP32Arm6DOF_DW.obj_j.matlabCodegenIsDeleted = true;
  }

  /* End of Terminate for MATLABSystem: '<Root>/Mid Arm Servo' */

  /* Terminate for MATLABSystem: '<Root>/Rotation Servo' */
  if (!ESP32Arm6DOF_DW.obj_l.matlabCodegenIsDeleted) {
    ESP32Arm6DOF_DW.obj_l.matlabCodegenIsDeleted = true;
  }

  /* End of Terminate for MATLABSystem: '<Root>/Rotation Servo' */

  /* Terminate for MATLABSystem: '<Root>/VL53L0X Time Of Flight Sensor' */
  if (!ESP32Arm6DOF_DW.obj_i.matlabCodegenIsDeleted) {
    ESP32Arm6DOF_DW.obj_i.matlabCodegenIsDeleted = true;
  }

  /* End of Terminate for MATLABSystem: '<Root>/VL53L0X Time Of Flight Sensor' */

  /* Terminate for MATLABSystem: '<Root>/VL53L0X Time Of Flight Sensor.' */
  if (!ESP32Arm6DOF_DW.obj.matlabCodegenIsDeleted) {
    ESP32Arm6DOF_DW.obj.matlabCodegenIsDeleted = true;
  }

  /* End of Terminate for MATLABSystem: '<Root>/VL53L0X Time Of Flight Sensor.' */

  /* Terminate for MATLABSystem: '<Root>/Standard Servo Write.' */
  if (!ESP32Arm6DOF_DW.obj_g.matlabCodegenIsDeleted) {
    ESP32Arm6DOF_DW.obj_g.matlabCodegenIsDeleted = true;
  }

  /* End of Terminate for MATLABSystem: '<Root>/Standard Servo Write.' */
}

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
